package com.thinkstu.data;

import lombok.*;
import org.springframework.stereotype.*;

/**
 * @author : ThinkStu
 * @since : 2023/4/9, 17:14, 周日
 **/
@Data
@Component
public class BMIStringConfig {
    String[] _18_low = {
            "小可爱，你身材犹如一道清风，轻盈如柳。想必抓紧时间吃点东西，给那风儿点阻力吧！",
            "你的BMI已经进入了羽毛级别，吃点好吃的，升级成轻量级拳王吧！",
            "嘿，瘦弱的小可爱，别让风吹跑了你。快多吃点，让体重牵住你的脚步！",
            "身如柳絮的你，是不是轻轻一跃就能飞上天呢？别忘了吃饱喝足，让地心引力留住你哦！",
            "天啊，这么瘦，你一定是藏匿在身材间的超级英雄吧！多补充点能量，让你的超能力更强大！",
            "你这么瘦，竟然没有被风吹走！来吧，让我们一起增加一点负重！",
            "你是轻盈的羽毛，飘逸在风中，要保持，要享受，还要吃点美食喔！",
            "哇，你这么瘦，穿衣服都能当风筝，但也别忘了补充营养啊！",
            "小伙伴们都羡慕你的苗条身材，别忘了适当增加营养，让身体更健康哦！",
            "天啊，你简直就是时尚界的活广告，只要注意保持健康就更完美了！"
    };
    String[] _18_25 = {
            "恭喜你，坐拥完美身材！记得维持住这个水平，让别人羡慕不已哦！",
            "看来这个BMI范围的人是精英中的精英，你就是这个范围的典范！",
            "优秀的身材，需要不断锻炼和保持。你已经做得很好，继续努力吧！",
            "你的身材就像诗一般优美，别让岁月和零食磨灭了这个诗篇哦！",
            "保持现在的身材，你就是走在大街上的一道靓丽风景线！",
            "恭喜你！身材完美，就像黄金分割一样，继续保持，也要好好享受生活！",
            "你的身材就像一首诗，优美而和谐，继续锻炼，让生活更加精彩！",
            "哇塞，你的身材可以称得上是人体工程学的典范，保持住这个优势哦！",
            "你的身材就是健康的代表，别人都想向你学习呢！继续保持健康生活！",
            "恭喜你达到了完美BMI！你是健康的小能手，别忘了享受生活哦！"
    };
    String[] _25_28 = {
            "有点丰满是人生的调味料，不过别让它过量，影响你的味道哦！",
            "你的身材就像那诱人的巧克力，有点熔化了，别让它再溢出来吧！",
            "看来你是个美食家，别忘了运动也是人生一大乐趣，多动动吧！",
            "你的身材充满了活力，但别让它过于膨胀，适当运动一下，会更加完美哦！",
            "身材丰满的你，是不是藏着宇宙的秘密？快运动起来，揭开这个谜底吧！",
            "身材丰满，福气满满，锻炼一下，健康会更上一层楼！",
            "你的身材给人安全感十足，继续努力，健康生活在望！",
            "拥有丰满身材的你，更要照顾好健康，让生活更精彩！",
            "哇哦，您的BMI落在“小肥羊”范围内，可别小看了自己，毕竟您距离“蛮腰美背”只有一步之遥！",
            "健康最重要，但偶尔放纵一下也没关系。要不然的话，谁会喜欢跟一个永远吃不到甜品的人做朋友呢？"
    };
    String[] _28_35 = {
            "地球引力对你很有好感，但你要努力抵抗它，让自己更加健康!",
            "你的身材如同宇宙中的超新星，璀璨夺目。别忘了运动，让它更加持久哦！",
            "咱们这个BMI范围的朋友，要一起努力，让身体重回巅峰，健康才是王道！",
            "穿越大千世界，多锻炼，让健康成为你的王牌！",
            "你的身材就像云朵一样柔软，加油减肥，打造健康新境界！",
            "大地之上有你的足迹，努力减肥，让健康生活触手可及！",
            "你让人想拥抱，多锻炼，成为健康的达人！",
            "没错，有时候爱吃美食是一种快乐，但要记得，健康的身体更加重要哦！",
            "虽然身材不是最标准的，但是你的笑容绝对是最灿烂的！所以，不要给自己太大压力，保持快乐就是最美的身材！",
            "运动会让你感觉好极了，就算刚开始不太容易，也要坚持下去哦！"
    };
    String[] _35_height = {
            "你的身材如同蓬勃向上的大树，但别让它长过头了，一起努力减肥吧！",
            "你是宇宙中的巨无霸星系，让我们一起运动，让这个星系更加健康和美丽！",
            "你的身材就像一座富饶的大山，但也要让它变得更加健康，一起努力减肥吧！",
            "你是那海洋中的庞然大物，让我们一起努力，让这个大海更加美丽和健康！",
            "你的身材像是一座山，气势磅礴，减肥开始，健康之路就在脚下！",
            "你的身材就像一座城堡，宏伟壮观，减肥努力，健康就在城堡深处！",
            "你的犹如宇宙中的星球，神秘而独特，减肥前行，健康与你相伴！",
            "你充满力量，减肥起航，健康生活在前方！",
            "没有任何东西可以阻挡你追求健康，只要你有决心和毅力，一切都有可能！",
            "你是一个超级英雄！没有任何事情能阻止你成为健康的自己。"
    };


}
