package com.thinkstu.data;

import lombok.*;
import org.springframework.stereotype.*;

/**
 * @author : ThinkStu
 * @since : 2023/4/10, 09:07, 周一
 **/
@Data
@Component
public class RunShortStringConfig {
    String[] excellent = {
            "你的50米短跑就像超音速飞机，风驰电掣，继续保持，成为学校的速度之王！",
            "看你短跑的样子，简直就是闪电侠的翻版，保持这个状态，你就是运动之神！",
            "你的50米短跑犹如风中的幽灵，速度惊人，向前冲，成为健康的楷模！",
            "50米短跑高手，不愧是学校的骄傲，继续努力，你的未来一片光明！",
            "你的50米短跑就像奔驰的豹子，气吞万里，继续保持，让荣誉无处不在！",
    };
    String[] good = {
            "你的50米短跑如同猎豹追逐猎物，已经展现出惊人的速度，再加油，你会更快！",
            "你已经在50米短跑中领略了风驰电掣的乐趣，继续努力，你将成为短跑之星！",
            "你的50米短跑如同一颗流星划过夜空，再加把劲，你将点燃更多的星星！",
            "你在50米短跑中展示了不俗的速度，继续努力，你会成为闪电侠！",
            "你的50米短跑如同滑翔的海鸟，风驰电掣间已拥有优美的身姿，继续加油！",
    };
    String[] pass = {
            "你在50米短跑中展现了速度与激情，再努力一下，你将成为风靡全校的速度之神！",
            "你已经在50米短跑中找到了自己的节奏，再加把劲，你将实现突破！",
            "你的50米短跑如同蜻蜓点水，再加把劲，你将翱翔在速度的天空！",
            "你在50米短跑中展示了坚持与毅力，继续努力，你会成为短跑健将！",
            "你的50米短跑如同奋力前进的蚂蚁，虽然还不够快，但已在路上，加油吧！",
    };
    String[] fail = {
            "你的50米短跑如同小龟爬行，别气馁，继续努力，你会成为飞毛腿的！",
            "速度是可以提高的，50米短跑不及格也没关系，继续加油，你会成功！",
            "你的50米短跑如同踩着七彩祥云的猴子，再努力一下，你会飞得更高！",
            "在短跑中，每一秒都很重要，但如果你跑得太快，你就会错过感受风景的机会，所以，跑慢一点也有好处！",
            "人生就像短跑比赛，我们不能总是跑在前面，但我们可以一直努力追赶前方的人！"
    };
}
