package com.thinkstu.data;


import lombok.*;
import org.springframework.stereotype.*;

/**
 * @author : ThinkStu
 * @since : 2023/4/9, 22:00, 周日
 * 引体向上 & 仰卧起坐
 **/
@Data
@Component
public class YTXSStringConfig {
    String[] excellent = {
            "你的引体向上如同猴子爬树，敏捷矫健，继续保持，成为学校的猴王！",
            "看你引体向上的样子，简直就是运动员的榜样，保持这个状态，你就是学霸！",
            "你的引体向上犹如刺猬爬竿，不知疲倦，向上攀爬，成为运动之星！",
            "引体向上高手，不愧是学校的翘楚，继续努力，你的未来无可限量！",
            "你的引体向上就像蜘蛛侠在攀爬摩天大楼，继续保持，让荣誉满满！",
    };
    String[] good = {
            "你的引体向上如同猴子翻腾，已经展现出惊人的力量，再加油，你会更强！",
            "你已经在引体向上中领略了征服重力的快感，继续努力，你将成为横梁之王！",
            "你的引体向上如同海豚跃出水面，再加把劲，你将驾驭更高的浪潮！",
            "你在引体向上中展示了力量与激情，继续努力，你会成为学校的健身偶像！",
            "你的引体向上如同蝙蝠侠飞檐走壁，再加把劲，你将拥有无尽的力量！",
    };
    String[] pass = {
            "你在引体向上中展示了潜力，再加把劲，你将成为全校瞩目的力量之王！",
            "你已经在引体向上中找到了自己的节奏，再加把劲，你将实现突破！",
            "你的引体向上如同蜻蜓点水，再加把劲，你将飞向更高的天空！",
            "你在引体向上中展示了坚持与毅力，继续努力，你会成为力量健将！",
            "你的引体向上如同奋力前进的蚂蚁，虽然还不够强，但已在路上，加油吧！",
    };
    String[] fail = {
            "你的引体向上如同小鸟挣脱牢笼，别气馁，继续努力，你会飞得更高！",
            "力量是可以提高的，继续加油，你会成功！",
            "你的引体向上如同奋力摇摆的秋千，再努力一下，你会触摸更高的天空！",
            "引体向上不及格的你，像一颗含苞待放的花蕾，再努力一下，花开时分一定属于你！",
            "引体向上是需要耐力和毅力的运动，保持一步一步地前进，你会逐渐发现自己越来越强壮",
    };

}
