package com.thinkstu.data;

import lombok.*;
import org.springframework.stereotype.*;

/**
 * @author : ThinkStu
 * @since : 2023/4/10, 09:39, 周一
 **/
@Data
@Component
public class YwqzStringConfig {
    String[] excellent = {
            "你的仰卧起坐如同跳跃的弹簧，劲道十足，继续保持，成为学校的腹肌王！",
            "看你仰卧起坐的样子，简直就是健美达人，保持这个状态，你就是运动之星！",
            "你的仰卧起坐犹如翻滚的云朵，轻松自如，向前进，成为健康的代表！",
            "仰卧起坐高手，不愧是学校的骄傲，继续努力，你的未来一片光明！",
            "你的仰卧起坐就像是波浪起伏，充满力量，继续保持，让荣誉满满！",
            "你的仰卧起坐就像是孔雀开屏，美丽而动人，继续努力，成为运动的佼佼者！",
    };
    String[] good = {
            "你仰卧起坐的表现相当不错，再加把劲，你就是学校的榜样！",
            "哇，你的仰卧起坐成绩很不错哦，再加油一点点，成为腹肌小能手！",
            "你的仰卧起坐如同海豚跃出水面，轻盈而优美，再努力，你将无往不胜！",
            "你的引体向上如同猴子翻腾，已经展现出惊人的力量，再加油，你会更强！",
            "你已经在引体向上中领略了征服重力的快感，继续努力，你将成为横梁之王！"
    };
    String[] pass = {
            "你已经在引体向上中找到了自己的节奏，再加把劲，你将实现突破！",
            "你的引体向上如同蜻蜓点水，再加把劲，你将飞向更高的天空！",
            "你在引体向上中展示了坚持与毅力，继续努力，你会成为力量健将！",
            "你的引体向上如同奋力前进的蚂蚁，虽然还不够强，但已在路上，加油吧！",
            "及格没事，人生总要有点小波折才更有意思嘛！",
    };
    String[] fail = {
            "你的引体向上如同小鸟挣脱牢笼，别气馁，继续努力，你会飞得更高！",
            "力量是可以提高的，引体向上不及格也没关系，继续加油，你会成功！",
            "你的引体向上如同奋力摇摆的秋千，再努力一下，你会触摸更高的天空！",
            "引体向上不及格的你，像一颗含苞待放的花蕾，再努力一下，花开时分一定属于你！",
            "你的引体向上如同拨弄琴弦的手指，虽然还不熟练，但练习会让你变得更优秀！",
    };

}
