package com.thinkstu.data;

import lombok.*;
import org.springframework.stereotype.*;

/**
 * @author : ThinkStu
 * @since : 2023/4/10, 09:02, 周一
 **/
@Component
@Data
public class ZwtqqStringConfig {
    String[] excellent = {
            "你的坐位体前屈如同柔韧的橡皮筋，任性弯曲，继续保持，成为学校的柔韧之王！",
            "看你坐位体前屈的样子，简直就是瑜伽大师，保持这个状态，你就是运动之神！",
            "你的坐位体前屈犹如随风飘扬的小草，轻松自如，向前伸展，你会成为健康的楷模！",
            "坐位体前屈高手，不愧是学校的骄傲，继续努力，你的未来无限美好！",
            "你的坐位体前屈就像是韦德腾挪，无坚不摧，继续保持，让荣誉无处不在！",};
    String[] good = {
            "你的坐位体前屈仿佛柳枝舞动，舞动万象，再接再厉，你将成为柔韧界的传奇！",
            "你的坐位体前屈如同橡皮泥捏造，随意弯折，继续保持，助你成为柔韧冠军！",
            "你的坐位体前屈就像是小草迎风，柔韧有力，继续努力，成为柔韧的佼佼者！",
            "你坐位体前屈的表现相当不错，再加把劲，你就是学校的柔韧之星！",
            "你的坐位体前屈如同杨柳轻舞，优美而有力，再努力，你将无往不胜！",};
    String[] pass = {
            "你的坐位体前屈如同一棵弯腰的稻穗，已经有了收获的喜悦，再加油，你会更成功！",
            "坐位体前屈及格的你，就像小草努力向阳光招手，再加把劲，你会成为一棵大树！",
            "你的坐位体前屈在努力中获得了及格，再加油，你会成为瑜伽高手！",
            "你在坐位体前屈中展示了毅力，再加把劲，你将成为学校的柔韧之神！",
            "你的坐位体前屈如同彩虹跨越天际，虽然弯曲，但已迈过及格线，继续努力！"
    };
    String[] fail = {
            "你的坐位体前屈如同一棵顽强的植物，别气馁，继续努力，你会变得更柔韧！",
            "身体的柔韧性是可以锻炼的，坐位体前屈不及格也没关系，再接再厉，你会成功！",
            "你的坐位体前屈如同正在觅食的企鹅，再加把劲，你将拥有优美的身姿！",
            "你在坐位体前屈中展示了坚持，别灰心，再加把劲，你会成为柔韧的代名词！",
            "你的坐位体前屈如同慢慢崛起的太阳，虽然尚未升起，但阳光必将照耀大地，继续努力！"
    };
}



